{
    "projects":[
        {
            "name":"Codepen Challenges",
            "info":"This is a weekly challenge announced by CodePen, covering a range of topics including form processing, graphic manipulation, algorithms, and other frontend technologies. I have completed several projects and am continuously following the challenges!",
            "image":"../assets/images/codepen-preview.jpg",
            "link":"https://codepen.io/collection/VYRKBE?cursor=eyJwYWdlIjoxfQ%3D%3D"
        },
        {
            "name":"RSS-Line-Notifier",
            "info":"RSS Line Notifier is an RSS notification application developed using Node.js, utilizing the Express framework to set up a server and provide API endpoints for manual triggering and monitoring. This application primarily operates through automated processes, skillfully combining RSS services with the Line Notify API. It uses Express to retrieve data from specified RSS feeds (currently focused on weather alerts and warnings from the Meteorological Bureau, particularly targeting the southern region), filters the data, and instantly sends it to user groups via Line Notify. The system uses MongoDB to store sent notifications to prevent duplicates and is deployed on the Render platform. Additionally, Uptime Robot is used for regular scheduling to ensure the service's stability and timeliness.",
            "image":"../assets/images/rss-preview.png",
            "link":"https://github.com/yuch3nchen/rss-line-notifier"
        },
        {
            "name":"Vue Expense Tracker",
            "info":"This is an expense tracker developed using the Vue.js 3 framework, focusing on user experience and efficient financial management. It offers an intuitive interface to track income and expenses, including dynamic balance display, transaction history, and financial overview. The application uses a responsive design to ensure a great experience across various devices. Core features include adding and deleting transactions, real-time financial summaries, and data caching using localStorage. It demonstrates best practices in Vue.js 3, including the use of the Composition API and component-based SCSS architecture techniques.",
            "image":"../assets/images/vue-expense-tracker-preview.png",
            "link":"https://yuch3nchen.github.io/vue3-expense-tracker"
        },
        {
            "name":"Vue Notepad",
            "info":"This is a note-taking application with an intuitive user interface, supporting functions such as adding, editing, deleting notes, and status notifications. It is developed using the Vue.js framework and employs a component-based architecture, with Bootstrap 5 for responsive design. The application integrates the autosize plugin to adjust text areas based on content length. It supports reactive data management with two-way binding for real-time content updates and uses localStorage for content caching.",
            "image":"../assets/images/vue-notepad-preview.png",
            "link":"https://yuch3nchen.github.io/vue-notepad"
        },
        {
            "name":"Vue Todolist",
            "info":"This is a to-do application featuring functionalities for adding, deleting, priority grading, and status updating. It is developed using the Vue.js framework and employs a component-based architecture. Technically, it fully utilizes the core features of Vue.js and incorporates localStorage for content caching. In terms of the user interface, it integrates the Bootstrap framework and Google Fonts to create an attractive and user-friendly experience.",
            "image":"../assets/images/vue-todolist-preview.png",
            "link":"https://yuch3nchen.github.io/vue2-cli-todolist"
        }
    ]
}